[
    {
      "blogPostComment": "Lots to listen to! Thanks for participating in today's shoutout thread on music",
      "blogPostAuthor": "Katie @ Substack"
    },
    {
      "blogPostComment": "I write a (completely free!) short daily game where I select three songs I've been enjoying with a common thread between the lyrics - first reader to correctly guess wins!.",
      "blogPostAuthor": "Colin Medwick"
    },
    {
      "blogPostComment": "hi all! my name is Amaya and I write Record store. it's a weekly newsletter about mixes I make. recently featured artists include Arcade Fire, Kacey Musgraves, and Neil Young.",
      "blogPostAuthor": "Amaya Lim"
    },
    {
      "blogPostComment": "I write On Repeat, and 3x a week, I help make your playlists better one song at a time. This year, I've also taken on the challenge of reviewing 100 new (to me) records, and am writing about those as well.",
      "blogPostAuthor": "Kevin Alexander"
    },
    {
      "blogPostComment": "Thanks for the shoutout Kevin. We love writing Exile On Newbury St (eons.substack.com) and we always appreciate people spreading the word.",
      "blogPostAuthor": "Ken Warshaw"
    },
    {
      "blogPostComment": "In my newlsetter, I share a new original instrumental song every month (using the podcast or video feature).",
      "blogPostAuthor": "FogChaser"
    },
    {
      "blogPostComment": "Hi! My name is Robert and I write 'Listening Sessions,' a three-times-a-month Substack on music focusing primarily on artists and albums from the 1950s into the 70s. .",
      "blogPostAuthor": "Robert C. Gilbert"
    },
    {
      "blogPostComment": "So nice to have a whole thread dedicated to us music nerds! 🤘🏼 I started my journey over a year ago writing about things to watch, listen, read, play, etc",
      "blogPostAuthor": "Leo Mascaro"
    },
    {
      "blogPostComment": "Hello! I'm a Brooklyn-based performer named Natalie, a.k.a @noots.mcgoots, and I write a monthly newsletter about new music in attempts to accompany life with a silly little soundtrack.",
      "blogPostAuthor": "Natalie Myrick"
    },
    {
      "blogPostComment": "Helllllo, I write a newsletter that goes out weekly with thoughts on music (both new and old, usually in the punk, pop-punk, alternative, and pop-rock genres).",
      "blogPostAuthor": "Jason Tate"
    }
  ]
  